p "1. Дан целочисленный массив. Необходимо вывести вначале его элементы с четными индексами, а затем - с нечетными.	"
p "arr = [1, 2, 3, 4, 5, 6]"
p "arr.select.each_with_index { |e, i| puts e if i.even? }"
p "arr.select.each_with_index { |e, i| puts e if e.odd? }"
arr = [1, 2, 3, 4, 5, 6]
p arr.select.each_with_index { |e, i| puts e if i.even? }
p arr.select.each_with_index { |e, i| puts e if e.odd? }
p'---------------------------'

p "2. Дан целочисленный массив. Необходимо вывести вначале его элементы с нечетными индексами, а затем - четными.		"
p "arr = [1, 2, 3, 4, 5, 6]"
p "arr.select.each_with_index { |e, i| puts e if i.odd? }"
p "arr.select.each_with_index { |e, i| puts e if i.even? }"
arr = [1, 2, 3, 4, 5, 6]
p arr.select.each_with_index { |e, i| puts e if i.odd? }
p arr.select.each_with_index { |e, i| puts e if i.even? }
p'---------------------------'

p "3. Дан целочисленный массив. Найти индекс минимального элемента."
p "arr = [1, -5, 3, 0.85, 5, 77]"
p "arr.index(arr.min)"
arr = [1, -5, 3, 0.85, 5, 77]
p arr.index(arr.min)
p'---------------------------'

p "4. Дан целочисленный массив. Найти индекс максимального элемента."
p "arr = [1, -5, 3, 0.85, 5, 77]"
p "arr.index(arr.max)"
arr = [1, -5, 3, 0.85, 5, 77]
p arr.index(arr.max)
p'---------------------------'

p "5. Дан целочисленный массив и интервал a..b. Найти максимальный из элементов в этом интервале."
p "arr = [1, -5, 3, 0.85, 5, 77]"
p "a ,b = 1, 3"
p "arr[1..3].max"
arr = [1, -5, 3, 0.85, 5, 77]
a ,b = 1, 3
p arr[1..3].max
p'---------------------------'

p "6. Дан целочисленный массив и интервал a..b. Найти минимальный из элементов в этом интервале."
p "arr = [1, -5, 3, 0.85, 5, 77]"
p "a ,b = 1, 3"
p "arr[1..3].min"
arr = [1, -5, 3, 0.85, 5, 77]
a ,b = 1, 3
p arr[1..3].min
p'---------------------------'

p "7. Дан целочисленный массив. Заменить все положительные элементы на значение минимального."
p "arr = [1, -5, 3, 0.85, 5, 77]"
p "a = arr.min"
p "arr.map { |e| e > 0 ? a:e }"
arr = [1, -5, 3, 0.85, 5, 77]
a = arr.min
p arr.map { |e| e > 0 ? a:e }
p'---------------------------'

p "8. Дан целочисленный массив. Заменить все положительные элементы на значение максимального."
p "arr = [1, -5, 3, 0.85, 5, 77]"
p "a = arr.max"
p "arr.map { |e| e > 0 ? a : e }"
arr = [1, -5, 3, 0.85, 5, 77]
a = arr.max
p arr.map { |e| e > 0 ? a : e }
p'---------------------------'

p "9. Дан целочисленный массив. Заменить все отрицательные элементы на значение минимального."
p "arr = [1, -5, -10, 0.85, 5, 77]"
p "a = arr.min"
p "arr.map { |e| e < 0 ? a : e }"
arr = [1, -5, -10, 0.85, 5, 77]
a = arr.min
p arr.map { |e| e < 0 ? a : e }
p'---------------------------'

p "10. Дан целочисленный массив. Заменить все отрицательные элементы на значение максимального"
p "arr = [1, -5, -10, 0.85, 5, 77]"
p "a = arr.max"
p "arr.map { |e| e < 0 ? a : e }"
arr = [1, -5, -10, 0.85, 5, 77]
a = arr.max
p arr.map { |e| e < 0 ? a : e }
p'---------------------------'

p "11. Дан целочисленный массив. Осуществить циклический сдвиг элементов массива влево на одну позицию"
p "arr = [1, -5, -10, 0.85, 5, 77]"
p "arr.rotate(1)"
arr = [1, -5, -10, 0.85, 5, 77]
p arr.rotate(1)
p'------------------------'

p "12. Дан целочисленный массив. Осуществить циклический сдвиг элементов массива вправо на одну позицию.	"
p "arr = [1, -5, -10, 0.85, 5, 77]"
p "arr.rotate(1)"
arr = [1, -5, -10, 0.85, 5, 77]
p arr.rotate(-1)
p'------------------------'

p "13. Дан целочисленный массив. Упорядочить его по возрастанию. "
p"arr = [185, -5, 7, 88, 2]"
p"arr.to_a.sort"
arr = [185, -5, 7, 88, 2]
p arr.sort
p'------------------------'

p "14. Дан целочисленный массив. Упорядочить его по убыванию. "
p"arr = [185, -5, 7, 88, 2]"
p"arr.to_a.sort"
arr = [185, -5, 7, 88, 2]
p arr.to_a.sort.reverse
p'------------------------'

p "15. Дан целочисленный массив. Вывести индексы массива в том порядке, в котором соответствующие им элементы образуют убывающую последовательность."
p"arr = [185, -5, 7, 88, 2]"
p"arr.to_a.sort"
arr = [185, -5, 7, 88, 2]
p arr.each.with_index.to_a.sort.reverse
p'------------------------'

p "16. Дан целочисленный массив. Вывести индексы массива в том порядке, в котором соответствующие им элементы образуют возрастающую последовательность."
p"arr = [185, -5, 7, 88, 2]"
p"arr.to_a.sort"
arr = [185, -5, 7, 88, 2]
p arr.each.with_index.to_a.sort
p'------------------------'

p "17. Дан целочисленный массив. Найти количество минимальных элементов."
p"arr = [185, -5, 7, 88, -2]"
p"arr.count(arr.min)"
arr = [185, -5, 7, 88, -2]
p arr.count(arr.min)
p'------------------------'

p "18. Дан целочисленный массив. Найти количество максимальных элементов."
p"arr = [185, -5, 7, 88, -2]"
p"arr.count(arr.max)"
arr = [185, -5, 7, 88, -2]
p arr.count(arr.max)
p'------------------------'

p "19. Дан целочисленный массив. Найти минимальный четный элемент."
p"arr = [185, -5, 7, 88, -2]"
p"arr.select { |e| e.even? }.min"
arr = [185, -5, 7, 88, -2]
p arr.select { |e| e.even? }.min
p'------------------------'

p "20. Дан целочисленный массив. Найти минимальный нечетный элемент."
p"arr = [185, -5, 7, 88, -2]"
p"arr.select { |e| e.odd? }.min"
arr = [185, -5, 7, 88, -2]
p arr.select { |e| e.odd? }.min
p'------------------------'

p "21. Дан целочисленный массив. Найти максимальный четный элемент."
p"arr = [185, -5, 7, 88, -2]"
p"arr.select { |e| e.even? }.max"
arr = [185, -5, 7, 88, -2]
e = arr.max
p arr.select { |e| e.even? }.max"
p'------------------------'

p "22. Дан целочисленный массив. Найти максимальный нечетный элемент."
p"arr = [185, -5, 7, 88, -2]"
p"arr.select { |e| e.odd? }.max"
arr = [185, -5, 7, 88, -2]
e = arr.max
p arr.select { |e| e.odd? }.max
p'------------------------'

p "23. Дан целочисленный массив. Найти минимальный положительный элемент."
p"arr = [185, -5, 7, 88, -2]"
p"arr.select { |e| e > 0 }.min"
arr = [185, -5, 7, 88, -2]
e = arr.max
p arr.select { |e| e > 0 }.min
p'------------------------'

p "24. Дан целочисленный массив. Найти максимальный отрицательный элемент."
p"arr = [185, -5, 7, 88, -2]"
p"arr.select { |e| e < 0 }.max"
arr = [185, -5, 7, 88, -2]
e = arr.max
p arr.select { |e| e < 0 }.max
p'------------------------'

p "25. Дан целочисленный массив. Найти количество элементов, расположенных после последнего максимального."
p"arr = [185, -5, 7, 88, -2]"
p"arr.reverse.index(arr.max)"
arr = [185, -5, 7, 254, 88, -2]
p arr.reverse.index(arr.max)
p'------------------------'

p "26. Дан целочисленный массив. Найти количество элементов, расположенных перед последним минимальным."
p"arr = [185, -5, 7, 88, -2]"
p"arr.index(arr.min)"
arr = [185, -5, 7, 254, 88, -2]
p arr.index(arr.min)
p'------------------------'

p "27. Дан целочисленный массив. Найти количество элементов, расположенных перед последним максимальным."
p"arr = [185, -5, 7, 88, -2]"
p"arr.index(arr.max)"
arr = [185, -5, 7, 254, 88, -2]
p arr.index(arr.max)
p'------------------------'

p "28. Дан целочисленный массив. Найти количество элементов, расположенных после последнего минимального."
p"arr = [185, -5, 7, 88, -2]"
p"arr.reverse.index(arr.min)"
arr = [185, -5, 7, 254, 88, -2]
p arr.reverse.index(arr.min)
p'------------------------'

p "29. Дан целочисленный массив. Найти индекс последнего экстремального (то есть минимального или максимального) элемента."
p"arr = [185, -5, 7, 254, 88, -2]"
p"arr.index(arr.min)"
p "arr.index(arr.max)"
arr = [185, -5, 7, 254, 88, -2]
p arr.index(arr.min)
p arr.index(arr.max)
p'------------------------'

p "30. Дан целочисленный массив. Найти два наибольших элемента."
p"arr = [185, -5, 7, 88, -2]"
p "arr.max"
p "arr_new = arr - [arr.max]"
p "arr_new.max"
arr = [185, -5, 7, 254, 88, -2]
p arr.max
arr_new = arr - [arr.max]
p arr_new.max
p'------------------------'

p "31. Дан целочисленный массив. Найти два наименьших элемента."
p"arr = [185, -5, 7, 88, -2]"
p "arr.min"
p "arr_new = arr - [arr.min]"
p "arr_new.min"
arr = [185, -5, 7, 254, 88, -2]
p arr.min
arr_new = arr - [arr.min]
p arr_new.min
p'------------------------'

p "32. Дан целочисленный массив. Вывести вначале все его четные элементы, а затем - нечетные.	"
p"arr = [185, -5, 7, 88, -2]"
p "arr.select { |e| e.even? }"
p "arr.select { |e| e.odd? }"
arr = [185, -5, 7, 88, -2]
p arr.select { |e| e.even? }
p arr.select { |e| e.odd? }
p'------------------------'

p "33. Дан целочисленный массив. Вывести вначале все его нечетные элементы, а затем - четные."
p"arr = [185, -5, 7, 88, -2]"
p "arr.select { |e| e.odd? }"
p "arr.select { |e| e.even? }"
arr = [185, -5, 7, 88, -2]
p arr.select { |e| e.odd? }
p arr.select { |e| e.even? }
p'------------------------'

p "34. Дан целочисленный массив. Найти среднее арифметическое его элементов."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.sum/arr.size"
p arr.sum/arr.size
p'------------------------'

p "35. Дан целочисленный массив. Найти все четные элементы."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.select { |e| e.even? }"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.select { |e| e.even? }
p'------------------------'

p "36. Дан целочисленный массив. Найти количество четных элементов."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.select { |e| e.even? }.size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.select { |e| e.even? }.size
p'------------------------'

p "37. Дан целочисленный массив. Найти все нечетные элементы.	"
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.select { |e| e.odd? }"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.select { |e| e.odd? }
p'------------------------'

p "38. Дан целочисленный массив. Найти количество нечетных элементов.	"
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.select { |e| e.odd? }.size}"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.select { |e| e.odd? }.size
p'------------------------'

p "39. Дан целочисленный массив. Преобразовать его, прибавив к четным числам первый элемент. Первый и последний элементы массива не изменять."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "[arr.first] + arr[1...-1].map { |element| element.even? ? element + arr.first : element } + [arr.last]"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p [arr.first] + arr[1...-1].map { |element| element.even? ? element + arr.first : element } + [arr.last]
p'------------------------'

p "40. Дан целочисленный массив. Преобразовать его, прибавив к четным числам последний элемент. Первый и последний элементы массива не изменять."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.map { |element| element.even? && (element != arr[0] && element != arr[-1]) ? element + arr.last : element }"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.map { |element| element.even? && (element != arr[0] && element != arr[-1]) ? element + arr.last : element }
p'------------------------'

p "41. Дан целочисленный массив. Преобразовать его, прибавив к нечетным числам последний элемент. Первый и последний элементы массива не изменять."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.slice(0, 1) + arr.slice(1...-1).map { |element| element.odd? ? element + arr.last : element } + arr.slice(-1, 1)"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.slice(0, 1) + arr.slice(1...-1).map { |element| element.odd? ? element + arr.last : element } + arr.slice(-1, 1)
p'------------------------'

p "42. Дан целочисленный массив. Преобразовать его, прибавив к нечетным числам первый элемент. Первый и последний элементы массива не изменять."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.slice(0, 1) + arr.slice(1...-1).map { |element| element.odd? ? element + arr.first : element } + arr.slice(-1, 1)"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.slice(0, 1) + arr.slice(1...-1).map { |element| element.odd? ? element + arr.first : element } + arr.slice(-1, 1)
p'------------------------'

p "43. Дан целочисленный массив. Найти индекс первого экстремального (то есть минимального или максимального) элемента."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p"arr.rindex(arr.min)"
p "arr.rindex(arr.max)"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.rindex(arr.min)
p arr.rindex(arr.max)
p'------------------------'

p "44. Дан целочисленный массив. Найти количество элементов, расположенных перед первым минимальным."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.rindex(arr.min)"
p "arr_min=arr.index(arr.min)"
p "arr[0...arr_min].size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
arr.rindex(arr.min)
arr_min = arr.index(arr.min)
p arr[0...arr_min].size
p'------------------------'

p "45. Дан целочисленный массив. Найти количество элементов, расположенных перед первым максимальным.	."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr_min=arr.index(arr.max)"
p "arr[0...arr_min].size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
arr_min = arr.index(arr.max)
p arr[0...arr_min].size
p'------------------------'

p "46. Дан целочисленный массив. Найти количество элементов, расположенных после первого максимального."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr_min = arr.index(arr.max)"
p "arr[arr_min...-1].size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
arr_min = arr.index(arr.max)
p arr[arr_min...-1].size
p'------------------------'

p "47. Дан целочисленный массив. Найти количество элементов, расположенных после первого минимального"
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr_min = arr.index(arr.min)"
p "arr[arr_min...-1].size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
arr_min = arr.index(arr.min)
p arr[arr_min...-1].size
p'------------------------'

p "48. Дан целочисленный массив. Вывести индексы элементов, которые меньше своего левого соседа, и количество таких чисел."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr_new = (1...arr.size).select { |i| arr[i] < arr[i-1] }"
p "arr_new, arr_new.size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
arr_new = (1...arr.size).select { |i| arr[i] < arr[i-1] }
p arr_new, arr_new.size
p'--------------'

p "49. Дано число А и натуральное число N. Найти результат следующего выражения 1 + А + А*2 + А*3 + … + А*N."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "A, N = 20, 3"
p "(1..N).inject(1) { |e, i| e + A * i }"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
A, N = 20, 3
p (1..N).inject(1) { |e, i| e + A * i }
p'--------------'

p "50. Дан целочисленный массив. Найти среднее арифметическое модулей его элементов."
p"arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]"
p "arr.map(&:abs).sum / arr.size"
arr = [185, -5, 7, -2, 88, -2, -2, -5, 10, 7]
p arr.map(&:abs).sum / arr.size
